Catalogs/ВидыВложенийДляАктированияЕИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>ВидыВложенийДляАктированияЕИС</Name>
			<Comment>Справочник ЕИС nsiEADocType</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодТипаФайла</Name>
					<Comment>Код типа файла для формирования информации об исполнении контракта: A, О, ЕR, E (fileTypeCode)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуален</Name>
					<Comment>Признак актуальности (isActual)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрикрепляется</Name>
					<Comment>Признак невключения в информацию об исполнении контракта (noInclude)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыВложенийДляАктированияЕИС/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЕстьПравоРедактирования = ПравоДоступа("Изменение",
		Метаданные.Справочники.ВидыВложенийДляАктированияЕИС);
	Элементы.ФормаОбновитьИзМакета.Доступность = ЕстьПравоРедактирования;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьИзМакета(Команда)
	
	ОбновитьИзМакетаНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьИзМакетаНаСервере()
	
	Макет = Справочники.ВидыВложенийДляАктированияЕИС.ПолучитьМакет("ВидыВложенийЕИС_ru");
	
	СтроковыйБуфер = ПолучитьСтрокуИзДвоичныхДанных(Макет, "UTF-8");
	
	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(СтроковыйБуфер);
	ДанныеФайла = ФабрикаXDTO.ПрочитатьXML(Чтение);
	Чтение.Закрыть();
	
	Для каждого ТипДокумента Из ДанныеФайла.nsiEADocTypes.nsiEADocType Цикл
		Код = ТипДокумента.code;
		Имя = ТипДокумента.name;
		Идентификатор = ТипДокумента.id;
		Актуален = XMLЗначение(Тип("Булево"), ТипДокумента.isActual);
		Элемент = Справочники.ВидыВложенийДляАктированияЕИС.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(Элемент) Тогда
			Если НЕ Элемент.Наименование = Имя
				ИЛИ НЕ Элемент.Актуален = Актуален Тогда
				ОбъектЭлемента = Элемент.ПолучитьОбъект();
				ОбъектЭлемента.Наименование = Имя;
				ОбъектЭлемента.Актуален = Актуален;
				ОбъектЭлемента.Записать();
				Шаблон = НСтр("ru = 'Изменен вид вложения ""%1.""'");
				ТекстСообщения = СтрШаблон(Шаблон, Имя);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		Иначе
			Если Актуален Тогда
				ОбъектЭлемента = Справочники.ВидыВложенийДляАктированияЕИС.СоздатьЭлемент();
				ОбъектЭлемента.Код = Код;
				ОбъектЭлемента.Идентификатор = Идентификатор;
				ОбъектЭлемента.Наименование = Имя;
				ОбъектЭлемента.Актуален = Актуален;
				ОбъектЭлемента.Записать();
				Шаблон = НСтр("ru = 'Создан вид вложения ""%1.""'");
				ТекстСообщения = СтрШаблон(Шаблон, Имя);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ТекстСообщения = НСтр("ru = 'Виды вложений были успешно обновлены.'");
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти
